vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32U3xx_DFP.pdsc
        <!-- *************************  Device 'STM32U375RETxQ'   ***************************** -->
        <device Dname="STM32U375RETxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U375REIx'   ***************************** -->
        <device Dname="STM32U375REIx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U375REIxQ'   ***************************** -->
        <device Dname="STM32U375REIxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U375CETx'   ***************************** -->
        <device Dname="STM32U375CETx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U375CEUx'   ***************************** -->
        <device Dname="STM32U375CEUx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U375KEUx'   ***************************** -->
        <device Dname="STM32U375KEUx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="32"/>
        </device>
        <!-- *************************  Device 'STM32U375VETxQ'   ***************************** -->
        <device Dname="STM32U375VETxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32U375REYxQ'   ***************************** -->
        <device Dname="STM32U375REYxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="68"/>
        </device>
        <!-- *************************  Device 'STM32U375REYxG'   ***************************** -->
        <device Dname="STM32U375REYxG">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="68"/>
        </device>
        <!-- *************************  Device 'STM32U375CEYxQ'   ***************************** -->
        <device Dname="STM32U375CEYxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="52"/>
        </device>
