vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32U3xx_DFP.pdsc
        <!-- *************************  Device 'STM32U375CETxQ'   ***************************** -->
        <device Dname="STM32U375CETxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U375CEUxQ'   ***************************** -->
        <device Dname="STM32U375CEUxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0800.FLM"  start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_512K_0C00.FLM"  start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="48"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'STM32U385'  ************************** -->
      <subFamily DsubFamily="STM32U385">
        <compile define="STM32u385xx"/>
        <debug svd="CMSIS/SVD/STM32U3.svd"/>

        <book name="https://www.st.com/resource/en/datasheet/stm32u385cg.pdf" title="STM32U385xx Datasheet"/>

        <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00030000" default="1" init="0" />
        <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00030000" alias="SRAM1_NS" />
        <memory name="SRAM2_NS" access="rwx" start="0x20030000" size="0x00010000" default="1" init="0" />
        <memory name="SRAM2_S"  access="rwx" start="0x30030000" size="0x00010000" alias="SRAM2_NS" />

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32U385VGTx'   ***************************** -->
        <device Dname="STM32U385VGTx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32U385VGTxQ'   ***************************** -->
        <device Dname="STM32U385VGTxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32U385VGIx'   ***************************** -->
        <device Dname="STM32U385VGIx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="100"/>
        </device>
        <!-- *************************  Device 'STM32U385VGIxQ'   ***************************** -->
        <device Dname="STM32U385VGIxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="100"/>
        </device>
        <!-- *************************  Device 'STM32U385RGTx'   ***************************** -->
        <device Dname="STM32U385RGTx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U385RGTxQ'   ***************************** -->
        <device Dname="STM32U385RGTxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
