vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32U3xx_DFP.pdsc
        <!-- *************************  Device 'STM32U385RGIx'   ***************************** -->
        <device Dname="STM32U385RGIx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U385RGIxQ'   ***************************** -->
        <device Dname="STM32U385RGIxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32U385CGTx'   ***************************** -->
        <device Dname="STM32U385CGTx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U385CGTxQ'   ***************************** -->
        <device Dname="STM32U385CGTxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U385CGUx'   ***************************** -->
        <device Dname="STM32U385CGUx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U385CGUxQ'   ***************************** -->
        <device Dname="STM32U385CGUxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32U385KGUx'   ***************************** -->
        <device Dname="STM32U385KGUx">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="QFN" n="32"/>
        </device>
        <!-- *************************  Device 'STM32U385RGYxQ'   ***************************** -->
        <device Dname="STM32U385RGYxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="68"/>
        </device>
        <!-- *************************  Device 'STM32U385RGYxG'   ***************************** -->
        <device Dname="STM32U385RGYxG">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="68"/>
        </device>
        <!-- *************************  Device 'STM32U385CGYxQ'   ***************************** -->
        <device Dname="STM32U385CGYxQ">
          <memory name="Flash_NS" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx" start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0800.FLM"    start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00008000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U3xx_1M_0C00.FLM"    start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x00008000" default="1" />
          <feature type="CSP" n="52"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32U3">
      <description>STMicroelectronics STM32U3 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32U3*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32U3 CMSIS">
      <description>STMicroelectronics STM32U3 Device and CMSIS-CORE</description>
      <require condition="STM32U3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32U3 CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32u3xx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://open-cmsis-pack.github.io/cmsis-toolbox/CubeMX"/>
      </files>
    </component>

  </components>

  <csolution>
    <!-- CubeMX Basic CMSIS Solution template -->
    <template name="CubeMX Basic solution" path="Templates/CubeMX" file="CubeMX.csolution.yml" condition="STM32U3">
      <description>Create a CubeMX basic solution with project</description>
    </template>

    <!-- CubeMX TrustZone CMSIS Solution template -->
    <template name="CubeMX TrustZone solution" path="Templates/CubeMX_TZ" file="CubeMX_TZ.csolution.yml" condition="STM32U3">
      <description>Create a CubeMX TrustZone solution with secure and non-secure projects</description>
    </template>

  </csolution>

</package>
